# CwpCopyWallInserts Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..CwpCopyWallInserts Property
ParameterTypeId Class See Also
---
"Copy windows/doors/openings"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId CwpCopyWallInserts { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property CwpCopyWallInserts As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ CwpCopyWallInserts {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace